04-01-estado-global.org
#+setupfile: static/setupfile.org
#+html_link_up: 04-nucleo.html
#+title: Estado global
#+options: toc:t

#+property: header-args:rust :tangle src/core/state.rs

O  primeiro   submódulo  a  ser   citado  é  o  submódulo   de  /estado
global/. Aqui, criamos estruturas  e ferramentas relacionadas ao estado
global do interpretador de Majestic Lisp.

A  palavra /global/  pode ser  um pouco  sugestiva nesse  contexto, pois
parece designar globalidade no âmbito da implementação, mas esse não é
o  caso  aqui.  Por  /global/, compreenda-se  que  estamos  tratando  de
elementos  vitais  para o  interpretador  de  Lisp, que  precisam  ser
registrados durante o tempo de vida de execução do programa.

Por  exemplo, precisamos  ter alguma  forma de  registrar a  tabela de
símbolos utilizados, e também o escopo global da aplicação.

As  seções que  se seguem  tratarão de  estruturas criadas  no arquivo
~src/core/state.rs~.

* TODO Importações

Primeiramente,  trataremos  das   importações  necessárias  para  esse
submódulo. Utilizaremos  uma estrutura  de /hash/ para  registrar alguns
elementos  à medida  do  necessário e  também  para recuperar  algumas
informações,  e  usaremos a  estrutura  ~File~  para tratar  /streams/  de
arquivo.

Também importaremos a estrutura genérica  do coletor de lixo, que será
utilizada para envolver os objetos da nossa linguagem.

Ademais,  também importaremos  o tipo  padrão que  designa objetos  de
Majestic Lisp.

#+begin_src rust
use std::collections::HashMap;
use std::collections::VecDeque;
use std::fs::File;
use gc::Gc;
use super::Maj;
use crate::axioms::{ MajPrimFn, MajPrimArgs };
use bimap::BiMap;

use std::fmt;
#+end_src

No  caso dos  arquivos, é  conveniente  definir um  tipo que  implique
alocação dinâmica e também finalização sob demanda.

#+begin_src rust
type MajInternalStream = Option<File>;
#+end_src

* A estrutura ~MajState~: Estado global do Majestic Lisp

Criaremos, agora,  uma estrutura de  dados ~MajState~, que  representa o
estado /global/ do interpretador.

Para a  maior parte da  aplicação, esta  é uma estrutura  estática. Em
geral, ela possui as seguintes responsabilidades:

- Gerenciar uma lista de símbolos;
- Gerenciar o contexto global da aplicação;
- Armazenar handlers para primitivas;
- Gerenciar a forma interna dos /streams/.

#+begin_src rust
pub struct MajState {
    symbols:      BiMap<u64, String>,
    last_sym:     u64,
    primitives:   HashMap<u64, (MajPrimFn, MajPrimArgs)>,
    streams:      Vec<MajInternalStream>,
    free_streams: VecDeque<usize>,
    stdin_peeked: Option<char>,
    global_env:   Gc<Maj>
}
#+end_src

