doc/html/04-01-estado-global.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Estado global</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="04-nucleo.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Estado global</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83f4eea">1. <span class="todo TODO">TODO</span> Importações</a></li>
<li><a href="#org971165c">2. A estrutura <code>MajState</code>: Estado global do Majestic Lisp</a></li>
<li><a href="#org56adb4d">3. <span class="todo TODO">TODO</span> Métodos para o estado global</a></li>
<li><a href="#orge9f2bbf">4. <span class="todo TODO">TODO</span> Impressão do estado global (para debug)</a></li>
<li><a href="#org8a0d2b8">5. Mais construtores</a>
<ul>
<li><a href="#org2ae0b16">5.1. <span class="todo TODO">TODO</span> Criação do stream</a></li>
<li><a href="#org41913f5">5.2. Fechamento do stream</a></li>
<li><a href="#orgc85ab86">5.3. Status do stream</a></li>
<li><a href="#org38a0205">5.4. Empréstimo do stream</a></li>
<li><a href="#org351687e">5.5. Caractere espionado em <code>*stdin*</code></a></li>
<li><a href="#orgce73668">5.6. <span class="todo TODO">TODO</span> Vetores</a>
<ul>
<li><a href="#org6767e4a">5.6.1. Criação de vetores</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcdfade9">6. <span class="todo TODO">TODO</span> Contexto global</a></li>
</ul>
</div>
</div>
<p>
O  primeiro   submódulo  a  ser   citado  é  o  submódulo   de  <i>estado
global</i>. Aqui, criamos estruturas  e ferramentas relacionadas ao estado
global do interpretador de Majestic Lisp.
</p>

<p>
A  palavra <i>global</i>  pode ser  um pouco  sugestiva nesse  contexto, pois
parece designar globalidade no âmbito da implementação, mas esse não é
o  caso  aqui.  Por  <i>global</i>, compreenda-se  que  estamos  tratando  de
elementos  vitais  para o  interpretador  de  Lisp, que  precisam  ser
registrados durante o tempo de vida de execução do programa.
</p>

<p>
Por  exemplo, precisamos  ter alguma  forma de  registrar a  tabela de
símbolos utilizados, e também o escopo global da aplicação.
</p>

<p>
As  seções que  se seguem  tratarão de  estruturas criadas  no arquivo
<code>src/core/state.rs</code>.
</p>

<div id="outline-container-org83f4eea" class="outline-2">
<h2 id="org83f4eea"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Importações</h2>
<div class="outline-text-2" id="text-1">
<p>
Primeiramente,  trataremos  das   importações  necessárias  para  esse
submódulo. Utilizaremos  uma estrutura  de <i>hash</i> para  registrar alguns
elementos  à medida  do  necessário e  também  para recuperar  algumas
informações,  e  usaremos a  estrutura  <code>File</code>  para tratar  <i>streams</i>  de
arquivo.
</p>

<p>
Também importaremos a estrutura genérica  do coletor de lixo, que será
utilizada para envolver os objetos da nossa linguagem.
</p>

<p>
Ademais,  também importaremos  o tipo  padrão que  designa objetos  de
Majestic Lisp.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">collections</span>::<span style="color: #4ec9b0;">HashMap</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">collections</span>::<span style="color: #4ec9b0;">VecDeque</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">fs</span>::<span style="color: #4ec9b0;">File</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #4ec9b0;">Maj</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::{ <span style="color: #4ec9b0;">MajPrimFn</span>, <span style="color: #4ec9b0;">MajPrimArgs</span> };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">bimap</span>::<span style="color: #4ec9b0;">BiMap</span>;

<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::fmt;
</pre>
</div>

<p>
No  caso dos  arquivos, é  conveniente  definir um  tipo que  implique
alocação dinâmica e também finalização sob demanda.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">type</span> <span style="color: #4ec9b0;">MajInternalStream</span> = <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">File</span>&gt;;
</pre>
</div>
</div>
</div>

<div id="outline-container-org971165c" class="outline-2">
<h2 id="org971165c"><span class="section-number-2">2.</span> A estrutura <code>MajState</code>: Estado global do Majestic Lisp</h2>
<div class="outline-text-2" id="text-2">
<p>
Criaremos, agora,  uma estrutura de  dados <code>MajState</code>, que  representa o
estado <i>global</i> do interpretador.
</p>

<p>
Para a  maior parte da  aplicação, esta  é uma estrutura  estática. Em
geral, ela possui as seguintes responsabilidades:
</p>

<ul class="org-ul">
<li>Gerenciar uma lista de símbolos;</li>
<li>Gerenciar o contexto global da aplicação;</li>
<li>Armazenar handlers para primitivas;</li>
<li>Gerenciar a forma interna dos <i>streams</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #9cdcfe;">symbols</span>:      <span style="color: #4ec9b0;">BiMap</span>&lt;<span style="color: #4ec9b0;">u64</span>, <span style="color: #4ec9b0;">String</span>&gt;,
    <span style="color: #9cdcfe;">last_sym</span>:     <span style="color: #4ec9b0;">u64</span>,
    <span style="color: #9cdcfe;">primitives</span>:   <span style="color: #4ec9b0;">HashMap</span>&lt;<span style="color: #4ec9b0;">u64</span>, (<span style="color: #4ec9b0;">MajPrimFn</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>)&gt;,
    <span style="color: #9cdcfe;">streams</span>:      <span style="color: #4ec9b0;">Vec</span>&lt;<span style="color: #4ec9b0;">MajInternalStream</span>&gt;,
    <span style="color: #9cdcfe;">free_streams</span>: <span style="color: #4ec9b0;">VecDeque</span>&lt;<span style="color: #4ec9b0;">usize</span>&gt;,
    <span style="color: #9cdcfe;">stdin_peeked</span>: <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">char</span>&gt;,
    <span style="color: #9cdcfe;">global_env</span>:   <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
}
</pre>
</div>
</div>
</div>
