04-01-estado-global.org
* TODO Métodos para o estado global

A  seguir, criaremos  alguns métodos  de auxílio  para gerenciarmos  o
estado  global,  de forma  indireta,  a  partir  de outras  partes  do
programa.

Inicialmente, criamos um método público ~new~. Este método é estático,
sendo responsável pela criação e inicialização de um objeto ~MajState~.

O  que fazemos  aqui é  inicializar estruturas  como o  gerenciador de
símbolos, o contexto  global, e definimos o estado atual  de erro como
sendo ~nil~ (falso).

Ademais, usamos  a função ~majestic_initialize~ para  inicializar alguns
elementos  do estado  global, como  definições globais  e a  tabela de
símbolos, por exemplo.

#+begin_src rust
impl MajState {
    pub fn new() -> MajState {
        use crate::axioms::majestic_initialize;
        let mut state =
            MajState {
                symbols:      BiMap::new(),
                primitives:   HashMap::new(),
                last_sym:     0,
                streams:      Vec::new(),
                free_streams: VecDeque::new(),
                stdin_peeked: None,
                global_env:   Maj::nil()
            };
        majestic_initialize(&mut state);
        state
    }
}
#+end_src

Criaremos também  um método  ~gen_symbol~, associado ao  ~MajState~ atual,
desde que o mesmo seja /mutável/.

Símbolos  são,   na  realidade,   /números/,  normalmente   alocados  em
sequência.  Alguns símbolos  correspondem  a símbolos  /fixos/, que  são
compartilhados  através de  todas  as  instâncias de  interpretadores;
estes  fazem parte  dos  /axiomas/ da  linguagem,  que serão  discutidos
posteriormente. Demais  símbolos são alocados sob  demanda, tendo seus
respectivos números atribuídos à medida que forem necessários.

Todo símbolo possui uma representação textual associada, que só existe
de  fato  para  efeitos   estéticos;  o  interpretador  normalmente  é
executado  sem que  haja interferência  de nenhuma  comparação textual
para com os nomes dos símbolos.

Por tratarem-se de  elementos muito particulares para  o estado global
de  uma sessão,  a  geração de  um símbolo  dá-se  apenas quando  este
símbolo já não existe na tabela. Se o mesmo existe, então basta apenas
retornarmos o número associado a ele.

Utilizamos aqui uma estrutura de  ~BiMap~, capaz de associar /números/ dos
símbolos, como  índice, às  suas /representações textuais/.  A diferença
aqui é que  ambas as informações devem servir como  chave de pesquisa;
assim, poderemos recuperar  um símbolo através de  mera procura direta
pela sua  representação textual,  mas também poderemos  recuperar esta
representação textual através de seu índice.

Os  símbolos são  gerados sequencialmente,  começando do  número ~0~.  O
estado global da sessão mantém o histórico do número a ser gerado para
o próximo símbolo.

#+begin_src rust
impl MajState {
    pub fn gen_symbol(&mut self, name: &str) -> u64 {
        match self.symbols.get_by_right(&name.to_string()) {
            Some(old_sym) => *old_sym,
            None => {
                let new_sym = self.last_sym;
                self.last_sym += 1;
                self.symbols.insert(new_sym, name.to_string());
                new_sym
            }
        }
    }
}
#+end_src

# Geração de símbolo arbitrário

#+begin_src rust
impl MajState {
    pub fn gen_random_symbol(&mut self) -> u64 {
        let new_sym = self.last_sym;
        let sym_name = format!(":G{}", new_sym);
        self.last_sym += 1;
        self.symbols.insert(new_sym, sym_name.to_string());
        new_sym
    }
}
#+end_src

Como  anteriormente  citado,  precisamos  determinar  um  método  para
recuperar a representação  textual de um símbolo;  em outras palavras,
seu /nome/. Este processo é facilitado pela estrutura de ~BiMap~.

Caso o  símbolo não  tenha sido  registrado na  tabela de  símbolos do
interpretador,  então significa  que o  símbolo não  foi /internado/  no
mesmo.  Assim,  retornamos   um  texto  genérico  que   não  pode  ser
adequadamente compreendido pelo usuário, como ~~uninterned##5~.

#+begin_src rust
impl MajState {
    pub fn symbol_name(&self, sym: &u64) -> String {
        match self.symbols.get_by_left(sym) {
            Some(string) => string.clone(),
            None => format!("~uninterned##{}", sym)
        }
    }
}
#+end_src

# TODO: Adição de nova função primitiva

#+begin_src rust
impl MajState {
    pub fn register_primitive(
        &mut self,
        name: &'static str,
        arity: MajPrimArgs,
        f: MajPrimFn
    ) {
        use crate::maj_list;
        let symbol = Maj::symbol(self, name);
        if let Maj::Sym(num) = *symbol.clone() {
            self.primitives.insert(num, (f, arity));
            let (arity_type, arity) = match arity {
                MajPrimArgs::None =>
                    (Maj::symbol(self, "required"),
                     Maj::integer(0)),
                MajPrimArgs::Required(n) =>
                    (Maj::symbol(self, "required"),
                     Maj::integer(n as i64)),
                MajPrimArgs::Variadic(n) =>
                    (Maj::symbol(self, "variadic"),
                     Maj::integer(n as i64)),
            };
            self.push(symbol.clone(),
                  maj_list!(Maj::lit(), Maj::prim(),
                            symbol, arity_type, arity));
        } else {
            panic!("Error creating symbol for primitive function");
        }
    }
}
#+end_src

#+begin_src rust
impl MajState {
    pub fn find_primitive(&self, sym: Gc<Maj>) -> Option<&(MajPrimFn, MajPrimArgs)> {
        match *sym {
            Maj::Sym(num) => self.primitives.get(&num),
            _             => None,
        }
    }
}
#+end_src

