doc/html/04-01-estado-global.html

<div id="outline-container-org56adb4d" class="outline-2">
<h2 id="org56adb4d"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Métodos para o estado global</h2>
<div class="outline-text-2" id="text-3">
<p>
A  seguir, criaremos  alguns métodos  de auxílio  para gerenciarmos  o
estado  global,  de forma  indireta,  a  partir  de outras  partes  do
programa.
</p>

<p>
Inicialmente, criamos um método público <code>new</code>. Este método é estático,
sendo responsável pela criação e inicialização de um objeto <code>MajState</code>.
</p>

<p>
O  que fazemos  aqui é  inicializar estruturas  como o  gerenciador de
símbolos, o contexto  global, e definimos o estado atual  de erro como
sendo <code>nil</code> (falso).
</p>

<p>
Ademais, usamos  a função <code>majestic_initialize</code> para  inicializar alguns
elementos  do estado  global, como  definições globais  e a  tabela de
símbolos, por exemplo.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">new</span>() -&gt; <span style="color: #4ec9b0;">MajState</span> {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::majestic_initialize;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> =
            <span style="color: #4ec9b0;">MajState</span> {
                <span style="color: #9cdcfe;">symbols</span>:      <span style="color: #4ec9b0;">BiMap</span>::new(),
                <span style="color: #9cdcfe;">primitives</span>:   <span style="color: #4ec9b0;">HashMap</span>::new(),
                <span style="color: #9cdcfe;">last_sym</span>:     0,
                <span style="color: #9cdcfe;">streams</span>:      <span style="color: #4ec9b0;">Vec</span>::new(),
                <span style="color: #9cdcfe;">free_streams</span>: <span style="color: #4ec9b0;">VecDeque</span>::new(),
                <span style="color: #9cdcfe;">stdin_peeked</span>: <span style="color: #4ec9b0;">None</span>,
                <span style="color: #9cdcfe;">global_env</span>:   <span style="color: #4ec9b0;">Maj</span>::nil()
            };
        majestic_initialize(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);
        state
    }
}
</pre>
</div>

<p>
Criaremos também  um método  <code>gen_symbol</code>, associado ao  <code>MajState</code> atual,
desde que o mesmo seja <i>mutável</i>.
</p>

<p>
Símbolos  são,   na  realidade,   <i>números</i>,  normalmente   alocados  em
sequência.  Alguns símbolos  correspondem  a símbolos  <i>fixos</i>, que  são
compartilhados  através de  todas  as  instâncias de  interpretadores;
estes  fazem parte  dos  <i>axiomas</i> da  linguagem,  que serão  discutidos
posteriormente. Demais  símbolos são alocados sob  demanda, tendo seus
respectivos números atribuídos à medida que forem necessários.
</p>

<p>
Todo símbolo possui uma representação textual associada, que só existe
de  fato  para  efeitos   estéticos;  o  interpretador  normalmente  é
executado  sem que  haja interferência  de nenhuma  comparação textual
para com os nomes dos símbolos.
</p>

<p>
Por tratarem-se de  elementos muito particulares para  o estado global
de  uma sessão,  a  geração de  um símbolo  dá-se  apenas quando  este
símbolo já não existe na tabela. Se o mesmo existe, então basta apenas
retornarmos o número associado a ele.
</p>

<p>
Utilizamos aqui uma estrutura de  <code>BiMap</code>, capaz de associar <i>números</i> dos
símbolos, como  índice, às  suas <i>representações textuais</i>.  A diferença
aqui é que  ambas as informações devem servir como  chave de pesquisa;
assim, poderemos recuperar  um símbolo através de  mera procura direta
pela sua  representação textual,  mas também poderemos  recuperar esta
representação textual através de seu índice.
</p>

<p>
Os  símbolos são  gerados sequencialmente,  começando do  número <code>0</code>.  O
estado global da sessão mantém o histórico do número a ser gerado para
o próximo símbolo.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">gen_symbol</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">name</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>) -&gt; <span style="color: #4ec9b0;">u64</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">self</span>.symbols.get_by_right(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>name.to_string()) {
            <span style="color: #4ec9b0;">Some</span>(old_sym) =&gt; *old_sym,
            <span style="color: #4ec9b0;">None</span> =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">new_sym</span> = <span style="color: #569cd6;">self</span>.last_sym;
                <span style="color: #569cd6;">self</span>.last_sym += 1;
                <span style="color: #569cd6;">self</span>.symbols.insert(new_sym, name.to_string());
                new_sym
            }
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">gen_random_symbol</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">u64</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">new_sym</span> = <span style="color: #569cd6;">self</span>.last_sym;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym_name</span> = <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">":G</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, new_sym);
        <span style="color: #569cd6;">self</span>.last_sym += 1;
        <span style="color: #569cd6;">self</span>.symbols.insert(new_sym, sym_name.to_string());
        new_sym
    }
}
</pre>
</div>

<p>
Como  anteriormente  citado,  precisamos  determinar  um  método  para
recuperar a representação  textual de um símbolo;  em outras palavras,
seu <i>nome</i>. Este processo é facilitado pela estrutura de <code>BiMap</code>.
</p>

<p>
Caso o  símbolo não  tenha sido  registrado na  tabela de  símbolos do
interpretador,  então significa  que o  símbolo não  foi <i>internado</i>  no
mesmo.  Assim,  retornamos   um  texto  genérico  que   não  pode  ser
adequadamente compreendido pelo usuário, como <code>~uninterned##5</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">symbol_name</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">sym</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">u64</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">self</span>.symbols.get_by_left(sym) {
            <span style="color: #4ec9b0;">Some</span>(string) =&gt; string.clone(),
            <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"~uninterned##</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, sym)
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">register_primitive</span>(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>,
        <span style="color: #9cdcfe;">name</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span>,
        <span style="color: #9cdcfe;">arity</span>: <span style="color: #4ec9b0;">MajPrimArgs</span>,
        <span style="color: #9cdcfe;">f</span>: <span style="color: #4ec9b0;">MajPrimFn</span>
    ) {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_list;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">symbol</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #569cd6;">self</span>, name);
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(num) = *symbol.clone() {
            <span style="color: #569cd6;">self</span>.primitives.insert(num, (f, arity));
            <span style="color: #569cd6;">let</span> (arity_type, arity) = <span style="color: #569cd6;">match</span> arity {
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span> =&gt;
                    (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #569cd6;">self</span>, <span style="color: #ce9178;">"required"</span>),
                     <span style="color: #4ec9b0;">Maj</span>::integer(0)),
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(n) =&gt;
                    (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #569cd6;">self</span>, <span style="color: #ce9178;">"required"</span>),
                     <span style="color: #4ec9b0;">Maj</span>::integer(n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>)),
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(n) =&gt;
                    (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #569cd6;">self</span>, <span style="color: #ce9178;">"variadic"</span>),
                     <span style="color: #4ec9b0;">Maj</span>::integer(n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>)),
            };
            <span style="color: #569cd6;">self</span>.push(symbol.clone(),
                  <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::prim(),
                            symbol, arity_type, arity));
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Error creating symbol for primitive function"</span>);
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">find_primitive</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">sym</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>(<span style="color: #4ec9b0;">MajPrimFn</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>)&gt; {
        <span style="color: #569cd6;">match</span> *sym {
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(num) =&gt; <span style="color: #569cd6;">self</span>.primitives.get(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>num),
            _             =&gt; <span style="color: #4ec9b0;">None</span>,
        }
    }
}
</pre>
</div>
</div>
</div>
