04-01-estado-global.org
* TODO Impressão do estado global (para debug)

#+begin_src rust
impl fmt::Display for MajState {
    fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
        use crate::printing::maj_format_env;
        let _ =
            writeln!(f, "{} symbols registered", self.symbols.len());
        let _ =
            writeln!(f, "{} streams registered ({} free)",
                     self.streams.len(),
                     self.free_streams.len());
        let _ =
            writeln!(f, "{} primitives registered", self.primitives.len());
        let _ =
            writeln!(f, "global environment table:");
        let env = self.global_env.clone();
        let _ =
            writeln!(f, "{}", maj_format_env(&self, env));
        Ok(())
    }
}
#+end_src


* Mais construtores

#+begin_src rust
use super::types::{
    MajStream,
    MajStreamDirection,
    MajStreamType
};
#+end_src

