doc/html/04-01-estado-global.html

<div id="outline-container-orge9f2bbf" class="outline-2">
<h2 id="orge9f2bbf"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Impressão do estado global (para debug)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Display</span> <span style="color: #569cd6;">for</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">fmt</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">f</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Formatter</span>&lt;'<span style="color: #9cdcfe;">_</span>&gt;) -&gt; <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Result</span> {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format_env;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> symbols registered"</span>, <span style="color: #569cd6;">self</span>.symbols.len());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> streams registered (</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> free)"</span>,
                     <span style="color: #569cd6;">self</span>.streams.len(),
                     <span style="color: #569cd6;">self</span>.free_streams.len());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> primitives registered"</span>, <span style="color: #569cd6;">self</span>.primitives.len());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(f, <span style="color: #ce9178;">"global environment table:"</span>);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">env</span> = <span style="color: #569cd6;">self</span>.global_env.clone();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_env(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, env));
        <span style="color: #4ec9b0;">Ok</span>(())
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org8a0d2b8" class="outline-2">
<h2 id="org8a0d2b8"><span class="section-number-2">5.</span> Mais construtores</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #569cd6;">types</span>::{
    <span style="color: #4ec9b0;">MajStream</span>,
    <span style="color: #4ec9b0;">MajStreamDirection</span>,
    <span style="color: #4ec9b0;">MajStreamType</span>
};
</pre>
</div>
</div>
