04-01-estado-global.org
** TODO Criação do stream

# TODO: ARGH! Remova esse monte de repetições, isso é coisa de louco!

#+begin_src rust
impl MajState {
    pub fn make_stream_stdin(&mut self) -> Gc<Maj> {
        Gc::new(Maj::Stream(MajStream {
            direction: MajStreamDirection::In,
            handle:    usize::MAX,
            stype:     MajStreamType::Stdin
        }))
    }
}
#+end_src

#+begin_src rust
impl MajState {
    pub fn make_stream_stdout(&mut self) -> Gc<Maj> {
        Gc::new(Maj::Stream(MajStream {
            direction: MajStreamDirection::Out,
            handle:    usize::MAX,
            stype:     MajStreamType::Stdout
        }))
    }
}
#+end_src

#+begin_src rust
impl MajState {
    pub fn make_stream_stderr(&mut self) -> Gc<Maj> {
        Gc::new(Maj::Stream(MajStream {
            direction: MajStreamDirection::Out,
            handle:    usize::MAX,
            stype:     MajStreamType::Stderr
        }))
    }
}
#+end_src

#+begin_src rust
impl MajState {
    pub fn make_stream(
        &mut self,
        file: &str,
        direction: MajStreamDirection
    ) -> Option<Gc<Maj>> {
        match direction {
            MajStreamDirection::In  => {
                let handle = File::open(file);
                if handle.is_err() {
                    return None;
                }

                let handle = handle.unwrap();
                let index;
                if self.free_streams.is_empty() {
                    self.streams.push(Some(handle));
                    index = self.streams.len() - 1;
                } else {
                    index = self.free_streams
                        .pop_front()
                        .unwrap();
                    self.streams[index] = Some(handle);
                }
                Some(Gc::new(Maj::Stream(
                    MajStream {
                        direction,
                        handle: index,
                        stype: MajStreamType::File,
                    })))
            }
            MajStreamDirection::Out => {
                let handle = std::fs::OpenOptions::new()
                    .create(true)
                    .append(true)
                    .open(file);
                if handle.is_err() {
                    return None;
                }

                let handle = handle.unwrap();
                let index;
                if self.free_streams.is_empty() {
                    self.streams.push(Some(handle));
                    index = self.streams.len() - 1;
                } else {
                    index = self.free_streams
                        .pop_front()
                        .unwrap();
                    self.streams[index] = Some(handle);
                }
                Some(Gc::new(Maj::Stream(
                    MajStream {
                        direction,
                        handle: index,
                        stype: MajStreamType::File,
                    })))
            },
        }
    }
}
#+end_src

