doc/html/04-01-estado-global.html

<div id="outline-container-org2ae0b16" class="outline-3">
<h3 id="org2ae0b16"><span class="section-number-3">5.1.</span> <span class="todo TODO">TODO</span> Criação do stream</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">make_stream_stdin</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(<span style="color: #4ec9b0;">MajStream</span> {
            <span style="color: #9cdcfe;">direction</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>,
            <span style="color: #9cdcfe;">handle</span>:    <span style="color: #4ec9b0;">usize</span>::<span style="color: #4ec9b0;">MAX</span>,
            <span style="color: #9cdcfe;">stype</span>:     <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stdin</span>
        }))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">make_stream_stdout</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(<span style="color: #4ec9b0;">MajStream</span> {
            <span style="color: #9cdcfe;">direction</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>,
            <span style="color: #9cdcfe;">handle</span>:    <span style="color: #4ec9b0;">usize</span>::<span style="color: #4ec9b0;">MAX</span>,
            <span style="color: #9cdcfe;">stype</span>:     <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stdout</span>
        }))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">make_stream_stderr</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(<span style="color: #4ec9b0;">MajStream</span> {
            <span style="color: #9cdcfe;">direction</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>,
            <span style="color: #9cdcfe;">handle</span>:    <span style="color: #4ec9b0;">usize</span>::<span style="color: #4ec9b0;">MAX</span>,
            <span style="color: #9cdcfe;">stype</span>:     <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stderr</span>
        }))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">make_stream</span>(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>,
        <span style="color: #9cdcfe;">file</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>,
        <span style="color: #9cdcfe;">direction</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>
    ) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
        <span style="color: #569cd6;">match</span> direction {
            <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>  =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">handle</span> = <span style="color: #4ec9b0;">File</span>::open(file);
                <span style="color: #569cd6;">if</span> handle.is_err() {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">None</span>;
                }

                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">handle</span> = handle.unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span>;
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.free_streams.is_empty() {
                    <span style="color: #569cd6;">self</span>.streams.push(<span style="color: #4ec9b0;">Some</span>(handle));
                    index = <span style="color: #569cd6;">self</span>.streams.len() - 1;
                } <span style="color: #569cd6;">else</span> {
                    index = <span style="color: #569cd6;">self</span>.free_streams
                        .pop_front()
                        .unwrap();
                    <span style="color: #569cd6;">self</span>.streams[index] = <span style="color: #4ec9b0;">Some</span>(handle);
                }
                <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(
                    <span style="color: #4ec9b0;">MajStream</span> {
                        direction,
                        <span style="color: #9cdcfe;">handle</span>: index,
                        <span style="color: #9cdcfe;">stype</span>: <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">File</span>,
                    })))
            }
            <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span> =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">handle</span> = <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">fs</span>::<span style="color: #4ec9b0;">OpenOptions</span>::new()
                    .create(<span style="color: #569cd6;">true</span>)
                    .append(<span style="color: #569cd6;">true</span>)
                    .open(file);
                <span style="color: #569cd6;">if</span> handle.is_err() {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">None</span>;
                }

                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">handle</span> = handle.unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span>;
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.free_streams.is_empty() {
                    <span style="color: #569cd6;">self</span>.streams.push(<span style="color: #4ec9b0;">Some</span>(handle));
                    index = <span style="color: #569cd6;">self</span>.streams.len() - 1;
                } <span style="color: #569cd6;">else</span> {
                    index = <span style="color: #569cd6;">self</span>.free_streams
                        .pop_front()
                        .unwrap();
                    <span style="color: #569cd6;">self</span>.streams[index] = <span style="color: #4ec9b0;">Some</span>(handle);
                }
                <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(
                    <span style="color: #4ec9b0;">MajStream</span> {
                        direction,
                        <span style="color: #9cdcfe;">handle</span>: index,
                        <span style="color: #9cdcfe;">stype</span>: <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">File</span>,
                    })))
            },
        }
    }
}
</pre>
</div>
</div>
</div>
