04-01-estado-global.org
** Fechamento do stream

#+begin_src rust
impl MajState {
    pub fn close_stream(&mut self, stream: Gc<Maj>) -> Gc<Maj> {
        use crate::axioms::primitives::maj_err;
        use crate::maj_list;
        if let Maj::Stream(mstream) = &*stream.clone() {
            if mstream.is_internal() {
                return maj_err(
                    Maj::string("Cannot close standard streams"),
                    Maj::nil());
            }

            let index = mstream.handle;
            if self.streams.len() <= index {
                maj_err(
                    Maj::string("Invalid stream {}"),
                    maj_list!(stream))
            } else {
                if self.streams[index].is_none() {
                    Maj::nil()
                } else {
                    self.streams[index] = None;
                    self.free_streams.push_back(index);
                    Maj::t()
                }
            }
        }  else {
            maj_err(
                Maj::string("Not a stream: {}"),
                maj_list!(stream))
        }
    }
}
#+end_src

** Status do stream

#+begin_src rust
impl MajState {
    pub fn stat_stream(&mut self, which: usize) -> Gc<Maj> {
        use crate::axioms::primitives::maj_err;
        if self.streams.len() <= which {
            maj_err(
                Maj::string("Invalid stream"),
                Maj::nil())
        } else {
            if self.streams[which].is_none() {
                Maj::nil()
            } else {
                Maj::t()
            }
        }
    }
}
#+end_src

** Empréstimo do stream

#+begin_src rust
impl MajState {
    pub fn borrow_stream(&self, which: usize) -> Option<&File> {
        if self.streams.len() <= which {
            None
        } else if self.streams[which].is_none() {
            None
        } else {
            Some(&self.streams[which].as_ref().unwrap())
        }
    }
}
#+end_src

** Caractere espionado em ~*stdin*~

#+begin_src rust
impl MajState {
    pub fn push_stdin_peeked(&mut self, c: char) {
        if self.stdin_peeked.is_some() {
            panic!("Cannot overwrite peeked *stdin* character!");
        }
        self.stdin_peeked = Some(c);
    }
}
#+end_src

#+begin_src rust
impl MajState {
    pub fn pop_stdin_peeked(&mut self) -> Option<char> {
        let result = self.stdin_peeked;
        self.stdin_peeked = None;
        result
    }
}
#+end_src

