doc/html/04-01-estado-global.html

<div id="outline-container-org41913f5" class="outline-3">
<h3 id="org41913f5"><span class="section-number-3">5.2.</span> Fechamento do stream</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">close_stream</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_err;
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_list;
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*stream.clone() {
            <span style="color: #569cd6;">if</span> mstream.is_internal() {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Cannot close standard streams"</span>),
                    <span style="color: #4ec9b0;">Maj</span>::nil());
            }

            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span> = mstream.handle;
            <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams.len() &lt;= index {
                maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Invalid stream {}"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(stream))
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams[index].is_none() {
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #569cd6;">self</span>.streams[index] = <span style="color: #4ec9b0;">None</span>;
                    <span style="color: #569cd6;">self</span>.free_streams.push_back(index);
                    <span style="color: #4ec9b0;">Maj</span>::t()
                }
            }
        }  <span style="color: #569cd6;">else</span> {
            maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Not a stream: {}"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream))
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc85ab86" class="outline-3">
<h3 id="orgc85ab86"><span class="section-number-3">5.3.</span> Status do stream</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stat_stream</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">which</span>: <span style="color: #4ec9b0;">usize</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_err;
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams.len() &lt;= which {
            maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Invalid stream"</span>),
                <span style="color: #4ec9b0;">Maj</span>::nil())
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams[which].is_none() {
                <span style="color: #4ec9b0;">Maj</span>::nil()
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Maj</span>::t()
            }
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org38a0205" class="outline-3">
<h3 id="org38a0205"><span class="section-number-3">5.4.</span> Empréstimo do stream</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">borrow_stream</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">which</span>: <span style="color: #4ec9b0;">usize</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">File</span>&gt; {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams.len() &lt;= which {
            <span style="color: #4ec9b0;">None</span>
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.streams[which].is_none() {
            <span style="color: #4ec9b0;">None</span>
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>.streams[which].as_ref().unwrap())
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org351687e" class="outline-3">
<h3 id="org351687e"><span class="section-number-3">5.5.</span> Caractere espionado em <code>*stdin*</code></h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">push_stdin_peeked</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">c</span>: <span style="color: #4ec9b0;">char</span>) {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">self</span>.stdin_peeked.is_some() {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot overwrite peeked *stdin* character!"</span>);
        }
        <span style="color: #569cd6;">self</span>.stdin_peeked = <span style="color: #4ec9b0;">Some</span>(c);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajState</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">pop_stdin_peeked</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">char</span>&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = <span style="color: #569cd6;">self</span>.stdin_peeked;
        <span style="color: #569cd6;">self</span>.stdin_peeked = <span style="color: #4ec9b0;">None</span>;
        result
    }
}
</pre>
</div>
</div>
</div>
